### DataFrame - Seleção condicional, set_index

In [1]:
import numpy as np
import pandas as pd

In [8]:
np.random.seed(101)

In [9]:
df = pd.DataFrame(np.random.randn(5, 4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [10]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
bol = df > 0

In [13]:
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

- A operação acima é equivalente a sequencia a seguir.

In [18]:
bol = df['W'] > 0
df2 = df[bol]
df2['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

#### Operações lógicas entre data frames

In [25]:
df[(df['W'] > 0) & (df['Y'] < 1) & (df['Y'] > 0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [28]:
df[(df['W'] > 0) & (df['Y'] < 0) | (df['Y'] > 2)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.reset_index()

ValueError: cannot insert level_0, already exists

In [39]:
df

   level_0 index         W         X         Y         Z
0        0     A  2.706850  0.628133  0.907969  0.503826
1        1     B  0.651118 -0.319318 -0.848077  0.605965
2        2     C -2.018168  0.740122  0.528813 -0.589001
3        3     D  0.188695 -0.758872 -0.933237  0.955057
4        4     E  0.190794  1.978757  2.605967  0.683509

In [48]:
col = 'AM SP MG ES RS'.split()

In [49]:
col

['AM', 'SP', 'MG', 'ES', 'RS']

In [50]:
df['Estados'] = col

In [51]:
df

         level_0 index         W         X         Y         Z Estados
Estados
AM,            0     A  2.706850  0.628133  0.907969  0.503826      AM
SP,            1     B  0.651118 -0.319318 -0.848077  0.605965      SP
MG,            2     C -2.018168  0.740122  0.528813 -0.589001      MG
ES,            3     D  0.188695 -0.758872 -0.933237  0.955057      ES
RS             4     E  0.190794  1.978757  2.605967  0.683509      RS

In [52]:
df.set_index('Estados', inplace=True)

In [53]:
df

         level_0 index         W         X         Y         Z
Estados
AM             0     A  2.706850  0.628133  0.907969  0.503826
SP             1     B  0.651118 -0.319318 -0.848077  0.605965
MG             2     C -2.018168  0.740122  0.528813 -0.589001
ES             3     D  0.188695 -0.758872 -0.933237  0.955057
RS             4     E  0.190794  1.978757  2.605967  0.683509

In [56]:
df.reset_index(drop=True, inplace=True)

In [61]:
df.index.delete(1)

Int64Index([0, 2, 3, 4], dtype='int64')

In [63]:
df

   level_0 index         W         X         Y         Z
0        0     A  2.706850  0.628133  0.907969  0.503826
1        1     B  0.651118 -0.319318 -0.848077  0.605965
2        2     C -2.018168  0.740122  0.528813 -0.589001
3        3     D  0.188695 -0.758872 -0.933237  0.955057
4        4     E  0.190794  1.978757  2.605967  0.683509